# напишите программу, в которой пользователь будет задавать две строки, программа - определять количество вхождений одной строки в другую

str1 = str(input('Enter your string: '))
str2 = str(input('Enter your second string'))

print(str1.count(str2))
